# https://matthiasportzel.com/brewfile/

# litecli
tap "dbcli/tap"
# bun
tap "oven-sh/bun"

# Better cat
brew "bat"
# Terminal cheatsheets
brew "cheat"
# Cocoapods Swift package manager
brew "cocoapods"
# Datasette database explorer
brew "datasette"
# Structured diffs
brew "difftastic"
# Deno TypeScript runtime
brew "deno"
# sqlite but columnar; also useful as a jq replacement 
brew "duckdb"
# Better du
brew "dust"
# Better ls
brew "eza"
# Better find
brew "fd"
# Better shell
brew "fish"
# Fuzzy finder
brew "fzf"
# GitHub CLI
brew "gh"
# Better diff viewer
brew "git-delta"
# Better curl
brew "httpie"
# Plain-text accounting
brew "hledger"
# git replacement
brew "jj"
# Add a more up-to-date less
brew "less"
# Better sqlite CLI
brew "litecli"
# Interact with LLM APIs easily
brew "llm"
# Markdown linter
brew "markdownlint-cli"
# Mac App Store CLI installer
brew "mas"
# Better vim
brew "neovim"
# Up-to-date node
brew "node"
# Better JS runtime
brew "oven-sh/bun/bun"
# Pandoc document converter
brew "pandoc"
# Install Python executables easily
brew "pipx"
# Better npm
brew "pnpm"
# Better make (for command running, at least)
brew "just"
# Pretty-print json
brew "jq"
# Better grep
brew "ripgrep"
# Better sed
brew "sd"
# Shell linter
brew "shellcheck"
# sqlite utils from simonw
brew "sqlite-utils"
# Command prompt
brew "starship"
# Swift formatting
brew "swiftformat"
# Swift linting
brew "swiftlint"
# Better tail with syntax highlighting
brew "tailspin"
# Rust implementation of tldr shell cheatsheet
brew "tealdeer"
# git repo viewer
brew "tig"
# LaTeX alternative
brew "typst"
# Directory watcher
brew "watchexec"
# Better c
brew "zig"
# Better cd
brew "zoxide"

# Non-Apple display management
cask "betterdisplay"
# Calibre ebook manager
cask "calibre"
# Fira Code / Fira Mono Nerd Fonts
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
# Use rcmd as hyperkey instead
cask "hyperkey"
# Terminal replacement
cask "iterm2"
# Better Spotlight
cask "raycast"
# VS Code
cask "visual-studio-code"
# Install Xcode easily
cask "xcodes"
# Zen web browser
cask "zen-browser"
# Zed editor
cask "zed"

mas "GoodLinks", id: 147_433_5294
mas "Fantastical", id: 975_937_182
mas "iA Writer", id: 775_737_590
mas "Things 3", id: 904_280_696
mas "Ulysses", id: 122_557_0693
mas "Velja", id: 160_763_5845

# Astro support
vscode "astro-build.astro-vscode"
# Ayu theme
vscode "teabyii.ayu"
# Black formatter for Python
vscode "ms-python.black-formatter"
# Copy file name command
vscode "nemesv.copy-file-name"
# Deno support
vscode "denoland.vscode-deno"
# Better error highlighting
vscode "usernamehw.errorlens"
# Fish support
vscode "bmalehorn.vscode-fish"
# GitLens to add lots of git features
vscode "eamodio.gitlens"
# File utils like deleting current file
vscode "sleistner.vscode-fileutils"
# GitHub Actions support
vscode "github.vscode-github-actions"
# Shift arguments left / right
vscode "Gruntfuggly.shifter"
# ESLint support
vscode "dbaeumer.vscode-eslint"
# hledger support
vscode "mark-hansen.hledger-vscode"
# justfile support
vscode "skellock.just"
# Better markdown keyboard shortcuts 
vscode "yzhang.markdown-all-in-one"
# markdownlint support
vscode "DavidAnson.vscode-markdownlint"
# MDX support
vscode "unifiedjs.vscode-mdx"
# Prettier formatter for TypeScript
vscode "esbenp.prettier-vscode"
# Better TypeScript error highlighting
vscode "YoavBls.pretty-ts-errors"
# Python support
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
# Typst support
vscode "nvarner.typst-lsp"
# Rust support
vscode "rust-lang.rust-analyzer"
# Swift support
vscode "sswg.swift-lang"
# Swiftformat support
vscode "vknabel.vscode-swiftformat"
# Swiftlint support
vscode "vknabel.vscode-swiftlint"
# Vim emulation
vscode "vscodevim.vim"
# Go-to-fuzzy-line
vscode "rbaumier.go-to-fuzzy"
# Stylelint support
vscode "stylelint.vscode-stylelint"
# TOML support
vscode "tamasfe.even-better-toml"
# CSS Modules support
vscode "clinyong.vscode-css-modules"
# Bookmarks
vscode "alefragnani.Bookmarks"
# HTML CSS IntelliSense support
vscode "ecmel.vscode-html-css"
# CSS Variables IntelliSense support
vscode "vunguyentuan.vscode-css-variables"
# Path autocompletion
vscode "christian-kohler.path-intellisense"
# zig support
vscode "ziglang.vscode-zig"
