# https://matthiasportzel.com/brewfile/

# litecli
tap "dbcli/tap"

# Better cat
brew "bat"
brew "bat-extras"
# Install rust binaries
brew "cargo-binstall"
# Terminal cheatsheets
brew "cheat"
# Brewfile manager
brew "chezmoi"
# Structured diffs
brew "difftastic"
# Deno TypeScript runtime
brew "deno"
# Better du
brew "dust"
# Better ls
brew "eza"
# Better find
brew "fd"
# ffmpeg support for yt-dlp
brew "ffmpeg"
# Better shell
brew "fish"
# Fish LSP
brew "fish-lsp"
# Fuzzy finder
brew "fzf"
# GitHub CLI
brew "gh"
# Better diff viewer
brew "git-delta"
# vim competitor
brew "helix"
# Better curl
brew "httpie"
# Plain-text accounting
brew "hledger"
# Add a more up-to-date less
brew "less"
# Better sqlite CLI
brew "litecli"
# Markdown linter
brew "markdownlint-cli"
# Mac App Store CLI installer
brew "mas"
# Environment manager
brew "mise"
# Better vim
brew "neovim"
# Up-to-date node
brew "node"
# Pandoc document converter
brew "pandoc"
# Install Python executables easily
brew "pipx"
# Better npm
brew "pnpm"
# Better make
brew "just"
# Pretty-print json
brew "jq"
# tmux
brew "tmux"
# Backups
brew "restic"
# Better grep
brew "ripgrep"
# Better sed
brew "sd"
# Shell linter
brew "shellcheck"
# Command prompt
brew "starship"
# Better tail with syntax highlighting
brew "tailspin"
# Rust implementation of tldr shell cheatsheet
brew "tealdeer"
# LaTeX alternative
brew "typst"
# Directory watcher
brew "watchexec"
# YouTube downloader
brew "yt-dlp"
# Better cd
brew "zoxide"

# 1password password manager
cask "1password-cli"
# Non-Apple display management
cask "betterdisplay"
# Calibre ebook manager
cask "calibre"
# Fira Code / Fira Mono Nerd Fonts
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
# Better terminal
cask "ghostty"
# Personal automations
cask "hammerspoon"
# SVG editor
cask "inkscape"
# Fix mouse scrolling
cask "mac-mouse-fix"
# Better Spotlight
cask "raycast"
# VS Code
cask "visual-studio-code"
# Install Xcode easily
cask "xcodes-app"
# Zed editor
cask "zed"

# mas "GoodLinks", id: 147_433_5294
# mas "Fantastical", id: 975_937_182
# mas "Hidden Bar", id: 145_245_3066
# mas "iA Writer", id: 775_737_590
# mas "Things 3", id: 904_280_696
# mas "Ulysses", id: 122_557_0693
# mas "Velja", id: 160_763_5845

# Astro support
vscode "astro-build.astro-vscode"
# Ayu theme
vscode "teabyii.ayu"
# Copy file name command
vscode "nemesv.copy-file-name"
# Better error highlighting
vscode "usernamehw.errorlens"
# Fish support
vscode "bmalehorn.vscode-fish"
# File utils like deleting current file
vscode "sleistner.vscode-fileutils"
# ESLint support
vscode "dbaeumer.vscode-eslint"
# hledger support
vscode "mark-hansen.hledger-vscode"
# justfile support
vscode "skellock.just"
# Better markdown keyboard shortcuts 
vscode "yzhang.markdown-all-in-one"
# markdownlint support
vscode "DavidAnson.vscode-markdownlint"
# MDX support
vscode "unifiedjs.vscode-mdx"
# Prettier formatter for TypeScript
vscode "esbenp.prettier-vscode"
# Better TypeScript error highlighting
vscode "YoavBls.pretty-ts-errors"
# Typst support
vscode "nvarner.typst-lsp"
# Rust support
vscode "rust-lang.rust-analyzer"
# Vim emulation
vscode "asvetliakov.vscode-neovim"
# Stylelint support
vscode "stylelint.vscode-stylelint"
# TOML support
vscode "tamasfe.even-better-toml"
# CSS Modules support
vscode "clinyong.vscode-css-modules"
# Bookmarks
vscode "alefragnani.Bookmarks"
# HTML/CSS support
vscode "ecmel.vscode-html-css"
# CSS Variables support
vscode "vunguyentuan.vscode-css-variables"
# Path autocompletion
vscode "christian-kohler.path-intellisense"
# Open in GitHub
vscode "sysoev.vscode-open-in-github"
# Lua support
vscode "sumneko.lua"
# Claude Code
vscode "Anthropic.claude-code"
